{"unk_token": "<unk>", "bos_token": "<sop>", "eos_token": "<eop>", "end_token": "</s>", "mask_token": "[MASK]", "gmask_token": "[gMASK]", "pad_token": "<pad>", "padding_side": "left", "do_lower_case": false, "num_image_tokens": 0, "remove_space": false, "tokenizer_class": "ChatGLMTokenizer", "model_max_length": 2048, "special_tokens_map_file": "/home/xy/.paddlenlp/models/THUDM/chatglm-6b/special_tokens_map.json"}