from pluginer import search


def test_api():
    cases = [["呼和浩特市艺术高级中学", "北京市"],
             # ["王景耀长沙酱板鸭", "深圳市"],
             ["北京化工大学", "北京市"],
             # ["北京农业职业学院", "北京市"],
             # ["友谊客栈", "北京市"],
             # ["芙二小区", "上海市"],
             # ["倒座庙小区", "上海市"],
             ["大牛坊社区", "北京市"],
             ["泰禾拾景园公租房小区", "北京市"],
             # ["南码头路119弄小区", "上海市"],
             # ["福田区外国语学校", "深圳市"],
             # ["虾满棠小龙虾烧烤", "上海市"],
             # ["乐而美", "上海市"],
             # ["北京信息职业技术学院", "北京市"],
             # ["北京外国语大学", "北京市"],
             # ["上海电力大学", "上海市"],
             ["北京交通大学", "北京市"],
             ["北京口腔医院", "北京市"],
             ["北医三院", "北京市"],
             ["积水潭医院", "北京市"],
             # ["北京东大肛肠医院", "北京市"],
             # ["北京市朝阳区第三医院", "北京市"],
             # ['上海市浦东新区中医医院', '上海市'],
             # ["望花路东里小区,", "北京市"],
             # ["安慧里", "北京市"],
             # ['石湖龙小区', '北京市'],
             # ['佳虹小区', '上海市'],
             # ['方东小区', '上海市'],
             # ['苏园小区', '北京市'],
             ['苏州胡同小区', '北京市'],
             # ['东余杭路７６０弄小区', '上海市'],
             # ['紫藤苑小区', '上海市'],
             ["和平里七区社区", "北京市"],
             # ['金沙小区', '上海市'],
             # ["川北社区", "北京市"],
             # ["惠新里小区", "北京市"],
             # ['双城路小区', "上海市"],
             # ["天通苑小区", "北京市"],
             # ["天通苑", "北京市"],  # top1为商圈
             # ["复兴门外大街小区", "北京市"],
             # ["陆象小区", "上海市"],
             # ['恋日嘉园小区', '北京市'],
             # ['凌兆小区', "上海市"],
             # ['上南六村社区', '上海市'],
             # ['永业小区', '上海市'],
             # ["芍药居北里1社区", "北京市"],
             # ['罗山一村社区', '上海市'],
             # ['桃园小区', '上海市'],
             # ['新高苑', '上海市'],
             # ['豫勺香', '上海市'],
             # ['七阿姨干锅焖饭', "上海市"],
             # ["老城一锅", "北京市"],
             # ["老城一", "北京市"],
             # ["美味速", "深圳市"],
             # ['罗罐中米粉', '上海市'],
             # ["海花锅盖烤肉店", "北京市"],
             # ["海花锅盖烤肉", "北京市"],
             # ["炒肝包子", "北京市"],
             # ["袁小饺", "深圳市"],
             ["中关村", "北京市"],
             ["北京大学", "北京市"],
             ["五道口", "北京市"],
             ]

    for item in cases:

        query, city = item

        if city != "北京市":
            continue
        result = search(query, city)
        print('result:', result)
        print("\n")


if __name__ == "__main__":
    test_api()

